app/Controllers/Home.php

    public function index()
    {
        helper('form');

        $cat = new Category();

        $data['title'] = lang('app.welcome');
        $data['cat'] = $cat->findAll();
---
SELECT *
FROM `categories`

    public function myProject()
    {
        $pr = new Project();
        $cat = new Category();

        $data['title'] = lang('app.projects');
        $data['cat'] = $cat->findAll();
---
SELECT *
FROM `categories`

    public function project($id)
    {
        $pr = new Project();
        $cat = new Category();

        $data['title'] = lang('app.projects');
        $data['cat'] = $cat->find($id);
        $data['pr'] = $pr->where('cat_id', $id)->findAll();
---
SELECT *
FROM `categories`
WHERE `categories`.`id` = '2'
SELECT *
FROM `projects`
WHERE `cat_id` = '2'