app/Controllers/ProjectController.php

SELECT *
FROM `projects`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `projects`
SELECT *
FROM `projects`
---
    public function index()
    {
        $pr = new Project();

        $data['title'] = lang('app.projects');
        $data['project'] = $pr->paginate(10);
        $data['p'] = $pr;
        // dd($data);

        if (!session('isLoggedIn')) {
            return redirect()->to('my-project');
        } else {
            $data['pr'] = $pr->findAll();

SELECT *
FROM `categories`
---
    public function add()
    {
        helper('form');

        $cat = new Category();

        $data['title'] = lang('app.projects');
        $data['cat'] = $cat->findAll();

SELECT *
FROM `categories`
SELECT *
FROM `projects`
WHERE `projects`.`id` = '1'
---
    public function show($id)
    {
        helper('form');

        $cat = new Category();
        $pr = new Project();

        $data['title'] = lang('app.project');
        $data['cat'] = $cat->findAll();
        $data['pr'] = $pr->find($id);